[GenjiClass X2SoldierClassTemplate]
-ClassSummary="源氏是刀刃与苦无的弟子，他的义体帮助他将这些武器发挥到极致."
+ClassSummary="源氏曾是岛田家族的忍者。他曾惨遭击败，身体受损至无法用常规手段修复。但守望先锋使用先进的义体技术重塑了他。凭借他作为前刺客的训练以及义体的增强，源氏成为了一股不容小觑的力量."

;***************************************
;New Ability Descriptions
;***************************************

;Genji Proficiency Ability
[VCP_GenjiMastery X2AbilityTemplate]
LocFriendlyName = "义体忍者精通"
LocHelpText = " <Ability:ClassName/>随着经验的积累，其义体增强的能力得到提升."
LocLongDescription = " <Ability:ClassName/>随着经验的积累，其义体增强的能力得到提升."
LocPromotionPopupText = "<font color='#CA7200'>等级1</font> (gained at <Ability:RANKNAME1/> rank [1])<br/><Bullet/> 获得<font color='#3ABD23'>机械忍者特技</font> - 无需装备即可跳跃任意高度.<br/><Bullet/> 获得+2移动力和+10闪避率.<br/><Bullet/> 获得+2 HP.<br/><br/><font color='#CA7200'>等级2</font> (gained at <Ability:RANKNAME3/> rank [3]<br/><Bullet/> 获得<font color='#3ABD23'>机械双持</font> - 如果仅装备了一把主近战武器，则伤害增加.<br/><Bullet/> 获得+2 移动力.<br/><br/><font color='#CA7200'>等级3</font> (gained at <Ability:RANKNAME5/> rank [5]<br/><Bullet/> 获得<font color='#3ABD23'>镀层装甲</font>.<br/><Bullet/> - 获得+1护甲值，且针对你的撕裂效果减弱.<br/><Bullet/> 获得+2 HP.<br/><br/><font color='#CA7200'>等级4</font> (gained at <Ability:RANKNAME7/> rank [7])<br/><Bullet/> 获得<font color='#3ABD23'>血肉横飞</font> -在你成功击杀敌人后，使其他敌人陷入恐慌.<br/><Bullet/> 获得+2 移动力."

[VCP_GenjiSwordMaster X2AbilityTemplate]
LocFriendlyName="剑术大师"
LocLongDescription="源氏到达XCOM后，进行了大量的训练以磨练他的刀刃技能."
LocHelpText="源氏到达XCOM后，进行了大量的训练以磨练他的刀刃技能."
LocFlyOverText="剑术大师" 
LocPromotionPopupText="<Bullet/>近战攻击命中率+15.<br/><Bullet/> 近战攻击伤害+3."

[VCP_DragonRage X2AbilityTemplate]
LocFriendlyName="龙之怒"
LocLongDescription="源氏使用龙刃的娴熟技艺，使他在使用其他武器时也占据了优势."
LocHelpText="源氏使用龙刃的娴熟技艺，使他在使用其他武器时也占据了优势."
LocFlyOverText="龙之怒" 
LocPromotionPopupText="<Bullet/> 近战攻击暴击率+15%.<br/><Bullet/> 近战暴击伤害+3."

[VCP_CyberneticReflexes X2AbilityTemplate]
LocFriendlyName="机械反射"
LocLongDescription="我真的需要解释为什么他比普通人快吗？"
LocHelpText="我真的需要解释为什么他比普通人快吗？"
LocFlyOverText="机械反射" 
LocPromotionPopupText="<Bullet/> +3 移动力.<br/><Bullet/> +20 闪避."

[VCP_ShimadaHeritage X2AbilityTemplate]
LocFriendlyName="岛田传承"
LocLongDescription="岛田家族的历史是用鲜血、牺牲和残酷训练书写的."
LocHelpText="岛田家族的历史是用鲜血、牺牲和残酷训练书写的."
LocFlyOverText="岛田传承" 
LocPromotionPopupText="<Bullet/> +2 护甲.<br/><Bullet/> 每回合恢复1点生命值，最多恢复至8点.<br/>"


